# Pandas Intro

### Load basic libraries

In [1]:
%load_ext autoreload
%autoreload 2
%matplotlib inline

import re
import time
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

pd.set_option('max_columns', 15)
pd.set_option('chained_assignment', None)

### Pandas Creation

In [2]:
# Create a pandas Series with some random numbers and index it with roman numbers up to 5:
indices = ['I', 'II', 'III', 'IV', 'V']
s = pd.Series(np.random.randn(5), index=indices)
s

I      0.567439
II     1.014973
III    0.533298
IV     0.108492
V      0.981753
dtype: float64

In [3]:
# Create a date range with eight dates
dates = pd.date_range('20200101', periods=8)

# Note: pd.date_range('2020-01-01', periods=8) will have the same effect

print(f"date type: {type(dates)}")
dates

date type: <class 'pandas.core.indexes.datetimes.DatetimeIndex'>

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08'],
              dtype='datetime64[ns]', freq='D')

Note that because we don't specify time, it is showing just the date with the day, but internally it is a datetime timestamp and if we request a start date and finish date with a period that doesn't align with 24h then it will show as well the time in the timestamp.

In [4]:
pd.date_range('2020-01-01', '2020-01-02', periods=8)

DatetimeIndex([          '2020-01-01 00:00:00',
               '2020-01-01 03:25:42.857142857',
               '2020-01-01 06:51:25.714285714',
               '2020-01-01 10:17:08.571428571',
               '2020-01-01 13:42:51.428571428',
               '2020-01-01 17:08:34.285714285',
               '2020-01-01 20:34:17.142857142',
                         '2020-01-02 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [5]:
# This fixes the random generator and allows us to obtain always the same results
np.random.seed(42)

# Combine the Series and the dates creation to create a pandas dataframe 
# with data for 8 days using the previous indices as columns
df = pd.DataFrame(np.random.randn(8, 5), index=dates, columns=indices)
df

                   I        II       III        IV         V
2020-01-01  0.496714 -0.138264  0.647689  1.523030 -0.234153
2020-01-02 -0.234137  1.579213  0.767435 -0.469474  0.542560
2020-01-03 -0.463418 -0.465730  0.241962 -1.913280 -1.724918
2020-01-04 -0.562288 -1.012831  0.314247 -0.908024 -1.412304
2020-01-05  1.465649 -0.225776  0.067528 -1.424748 -0.544383
2020-01-06  0.110923 -1.150994  0.375698 -0.600639 -0.291694
2020-01-07 -0.601707  1.852278 -0.013497 -1.057711  0.822545
2020-01-08 -1.220844  0.208864 -1.959670 -1.328186  0.196861

Load a dictionary into pandas:

In [6]:
# Load the dictionary into a pandas dataframe called 'df_countries':
data = {'Country':['United Kingdom', 'Spain', 'France', 'USA', 'Australia', 'Bangladesh', 'Belgium'],
        'Capital': ['London', 'Madrid', 'Paris', 'washington', 'Canberra', 'Dhaka', 'Brussels'],
        'Random': [3, 1, 4, 2, 8, 5, 6]}
df_countries = pd.DataFrame(data)
df_countries

          Country     Capital  Random
0  United Kingdom      London       3
1           Spain      Madrid       1
2          France       Paris       4
3             USA  washington       2
4       Australia    Canberra       8
5      Bangladesh       Dhaka       5
6         Belgium    Brussels       6

In [7]:
# Check columns types:
df_countries.dtypes

Country    object
Capital    object
Random      int64
dtype: object

Selecting rows and columns:

In [8]:
# Selecting 'country' column
col = df_countries['Country']

print(col)
print(f"\nColumn type: {type(col)}")

0    United Kingdom
1             Spain
2            France
3               USA
4         Australia
5        Bangladesh
6           Belgium
Name: Country, dtype: object

Column type: <class 'pandas.core.series.Series'>

In [9]:
# Select the column using dot notation
df_countries.Country

0    United Kingdom
1             Spain
2            France
3               USA
4         Australia
5        Bangladesh
6           Belgium
Name: Country, dtype: object

In [10]:
# Select the column as a new dataframe
df_col = df_countries[['Country']]

print(f"\nColumn type: {type(df_col)}")
df_col

Column type: <class 'pandas.core.frame.DataFrame'>

          Country
0  United Kingdom
1           Spain
2          France
3             USA
4       Australia
5      Bangladesh
6         Belgium

In [11]:
# Update the first value of the pandas column using dot notation
df_col.Country[0] = 'Brexit'

# Verify the change
df_col

      Country
0      Brexit
1       Spain
2      France
3         USA
4   Australia
5  Bangladesh
6     Belgium

In [12]:
# Check what happens with the original dataframe
df_countries

          Country     Capital  Random
0  United Kingdom      London       3
1           Spain      Madrid       1
2          France       Paris       4
3             USA  washington       2
4       Australia    Canberra       8
5      Bangladesh       Dhaka       5
6         Belgium    Brussels       6

In [13]:
# Transpose the dataframe
transposed = df_countries.T
transposed

,0,1,2,3,4,5,6
Country,United Kingdom,Spain,France,USA,Australia,Bangladesh,Belgium
Capital,London,Madrid,Paris,washington,Canberra,Dhaka,Brussels
Random,3,1,4,2,8,5,6

In [14]:
# Get all the data as numpy
df_countries.to_numpy()

array([['United Kingdom', 'London', 3],
       ['Spain', 'Madrid', 1],
       ['France', 'Paris', 4],
       ['USA', 'washington', 2],
       ['Australia', 'Canberra', 8],
       ['Bangladesh', 'Dhaka', 5],
       ['Belgium', 'Brussels', 6]], dtype=object)

Notes:

- The output doesn't know anything about index or column information
- The behaviour changes if the columns are from the same type vs. if they contain different types:
    - With the same time it is very fast as it is not a copy.
    - With different types it gets very expensive as it copies everything into a new object.

### Summary Info

In [15]:
# Get examples of the first 3 rows
df_countries.head(3)

          Country Capital  Random
0  United Kingdom  London       3
1           Spain  Madrid       1
2          France   Paris       4

In [16]:
# Other ways to get the same output with iloc and loc..
df_countries.iloc[:3, :]
df_countries.loc[:3, ['Country', 'Capital','Random']]

          Country Capital  Random
0  United Kingdom  London       3
1           Spain  Madrid       1
2          France   Paris       4

          Country     Capital  Random
0  United Kingdom      London       3
1           Spain      Madrid       1
2          France       Paris       4
3             USA  washington       2

In [17]:
# Get examples of the last 2 rows
df_countries.tail(2)

      Country   Capital  Random
5  Bangladesh     Dhaka       5
6     Belgium  Brussels       6

In [18]:
# List the indices of the DataFrame
print(f"Indices: {df_countries.index}")

# What are the indices of the previously transposed DataFrame?
print(f"Transposed index: {transposed.index}")

Indices: RangeIndex(start=0, stop=7, step=1)
Transposed index: Index(['Country', 'Capital', 'Random'], dtype='object')

In [19]:
# List the columns of the DataFrame
print(f"Indices: {df_countries.columns}")

# What are the columns of the previously transposed DataFrame?
print(f"Transposed index: {transposed.columns}")

Indices: Index(['Country', 'Capital', 'Random'], dtype='object')
Transposed index: RangeIndex(start=0, stop=7, step=1)

In [20]:
# Get statistics of numerical columns
df_countries.describe()

         Random
count  7.000000
mean   4.142857
std    2.410295
min    1.000000
25%    2.500000
50%    4.000000
75%    5.500000
max    8.000000

In [21]:
df_countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
Country    7 non-null object
Capital    7 non-null object
Random     7 non-null int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### More in Selection

We have seen  `df_countries.Country`  and `df_countries['Country']`  as possible ways to select a column.

What if we want to select specific rows?

In [22]:
# Select second and forth row by indices:
df_countries.iloc[[2, 4], :]

     Country   Capital  Random
2     France     Paris       4
4  Australia  Canberra       8

In [23]:
# Select again second and forth row but specifying the column names 'Country' and 'Capital':
df_countries.loc[[2, 4], ['Country', 'Capital']]

     Country   Capital
2     France     Paris
4  Australia  Canberra

In [24]:
# If you specify a single column, you get a series instead
series_selection = df_countries.loc[[2, 4], 'Country']

print(f"Type is: {type(series_selection)}")
series_selection

Type is: <class 'pandas.core.series.Series'>

2       France
4    Australia
Name: Country, dtype: object

### Boolean indexing

In [25]:
# Select the data where 'Random' > 3
df_countries[df_countries['Random'] > 3]

      Country   Capital  Random
2      France     Paris       4
4   Australia  Canberra       8
5  Bangladesh     Dhaka       5
6     Belgium  Brussels       6

In [26]:
# Select the rows where Capital is in the list ['Paris', 'Madrid']
my_list = ['Paris', 'Madrid']
df_countries[df_countries['Capital'].isin(my_list)]

  Country Capital  Random
1   Spain  Madrid       1
2  France   Paris       4

### Sorting:

In [27]:
# Sort the columns in descending order:
df_countries.sort_index(axis=1, ascending=False)

   Random         Country     Capital
0       3  United Kingdom      London
1       1           Spain      Madrid
2       4          France       Paris
3       2             USA  washington
4       8       Australia    Canberra
5       5      Bangladesh       Dhaka
6       6         Belgium    Brussels

In [28]:
# Sort by values of the 'Random' column
df_countries.sort_values(by='Random', ascending=True)

          Country     Capital  Random
1           Spain      Madrid       1
3             USA  washington       2
0  United Kingdom      London       3
2          France       Paris       4
5      Bangladesh       Dhaka       5
6         Belgium    Brussels       6
4       Australia    Canberra       8

### Modifying the data

In [29]:
# Create a new column called 'Continent' and fill it with 'Unknown'
df_countries['Continent'] = np.nan

# Given the following list, modify the values of 'Continent' for those countries to 'Europe'
isEurope = ['Belgium', 'France', 'Spain', 'United Kingdom']
df_countries.loc[df_countries['Country'].isin(isEurope), 'Continent'] = 'Europe'

df_countries

          Country     Capital  Random Continent
0  United Kingdom      London       3    Europe
1           Spain      Madrid       1    Europe
2          France       Paris       4    Europe
3             USA  washington       2       NaN
4       Australia    Canberra       8       NaN
5      Bangladesh       Dhaka       5       NaN
6         Belgium    Brussels       6    Europe

In [30]:
# Another way is to create a dictionary where we specify in the keys the condition and at the values the replacements
# and use replace to generate a new series that we can use to overwrite the Continent column
df_countries['Country'].isin(isEurope).replace({True: "Europe", False: "Unknown"})

0     Europe
1     Europe
2     Europe
3    Unknown
4    Unknown
5    Unknown
6     Europe
Name: Country, dtype: object

In [31]:
# Modify value of 'United Kindom' to 'UK' by position
df_countries.iat[0,0] = 'UK'
df_countries

      Country     Capital  Random Continent
0          UK      London       3    Europe
1       Spain      Madrid       1    Europe
2      France       Paris       4    Europe
3         USA  washington       2       NaN
4   Australia    Canberra       8       NaN
5  Bangladesh       Dhaka       5       NaN
6     Belgium    Brussels       6    Europe

In [32]:
# Clean up missing values from the dataframe:
df_countries.dropna(how='any')

   Country   Capital  Random Continent
0       UK    London       3    Europe
1    Spain    Madrid       1    Europe
2   France     Paris       4    Europe
6  Belgium  Brussels       6    Europe

Note that this creates a copy except when inplace is specified

In [33]:
# Fill missing data in Continent with 'World'. As before filling data creates a new DataFrame by default.
df_countries['Continent'] = df_countries.Continent.fillna('World')
df_countries

      Country     Capital  Random Continent
0          UK      London       3    Europe
1       Spain      Madrid       1    Europe
2      France       Paris       4    Europe
3         USA  washington       2     World
4   Australia    Canberra       8     World
5  Bangladesh       Dhaka       5     World
6     Belgium    Brussels       6    Europe

In [46]:
# Create a mask (filter) of the values that are NA:
df_countries.isna()

   Country  Capital  Random  Continent
0    False    False   False      False
1    False    False   False      False
2    False    False   False      False
3    False    False   False      False
4    False    False   False      False
5    False    False   False      False
6    False    False   False      False

In [50]:
df_countries

      Country     Capital  Random Continent
0          UK      London       3    Europe
1       Spain      Madrid       1    Europe
2      France       Paris       4    Europe
3         USA  washington       2     World
4   Australia    Canberra       8     World
5  Bangladesh       Dhaka       5     World
6     Belgium    Brussels       6    Europe

In [64]:
# Creating dataframe with random values
np.random.seed(42)
df_random = pd.DataFrame(np.random.random((5,5)))
df_random

          0         1         2         3         4
0  0.374540  0.950714  0.731994  0.598658  0.156019
1  0.155995  0.058084  0.866176  0.601115  0.708073
2  0.020584  0.969910  0.832443  0.212339  0.181825
3  0.183405  0.304242  0.524756  0.431945  0.291229
4  0.611853  0.139494  0.292145  0.366362  0.456070

### Stats

In [57]:
# Calculate the mean of the first column (df dataset):
print(f"First column mean: {df_random.iloc[:, 0].mean()}")

# Calculate the mean of all columns:
print(f"\nMean (all columns): \n{df_random.mean()}")

# Calculate the mean of all rows:
print(f"\nMean (all rows): \n{df_random.mean(axis=1)}")

First column mean: 0.4910291029583574

Mean (all columns):
0    0.491029
1    0.506780
2    0.248122
3    0.654537
dtype: float64

Mean (all rows):
0    0.663977
1    0.309068
2    0.574920
3    0.352503
dtype: float64

In [61]:
# Max and min of 'Random' in df_countries
print(f"Max value in random: {df_random.max()}")
print(f"min value in random: {df_random.min()}")

Max value in random: 0    0.832443
1    0.950714
2    0.731994
3    0.969910
dtype: float64
min value in random: 0    0.156019
1    0.155995
2    0.020584
3    0.183405
dtype: float64

In [68]:
%%timeit
# Use apply to obtain the difference between the max and and min by column
df_random.apply(lambda x: x.max() - x.min(), axis=0)

1.2 ms  40.3 s per loop (mean  std. dev. of 7 runs, 1000 loops each)

In [69]:
%%timeit
df_random.max(axis=0) - df_random.min(axis=0)

359 s  7.49 s per loop (mean  std. dev. of 7 runs, 1000 loops each)

In [38]:
# Create a matrix 'm' 8x8 with random integers from 0 to 9
m = pd.DataFrame(np.random.randint(0, 9, size=(8, 8)))
print(f"Matrix: \n{m}")

Matrix:
   0  1  2  3  4  5  6  7
0  1  1  3  7  6  8  7  4
1  1  4  7  8  8  0  8  6
2  8  7  0  7  7  2  0  7
3  2  2  0  4  6  8  6  8
4  7  1  0  6  6  7  4  2
5  7  5  2  0  2  4  2  0
6  4  6  6  8  2  6  0  3
7  3  4  6  6  3  6  2  5

In [39]:
# Count of each value across the 4th column
m.iloc[:,3].value_counts()

7    2
6    2
8    2
4    1
0    1
Name: 3, dtype: int64

In [40]:
# Perform the count of values for all rows
m.apply(lambda x: x.value_counts(), axis=1)

     0    1    2    3    4    5    6    7    8
0  NaN  2.0  NaN  1.0  1.0  NaN  1.0  2.0  1.0
1  1.0  1.0  NaN  NaN  1.0  NaN  1.0  1.0  3.0
2  2.0  NaN  1.0  NaN  NaN  NaN  NaN  4.0  1.0
3  1.0  NaN  2.0  NaN  1.0  NaN  2.0  NaN  2.0
4  1.0  1.0  1.0  NaN  1.0  NaN  2.0  2.0  NaN
5  2.0  NaN  3.0  NaN  1.0  1.0  NaN  1.0  NaN
6  1.0  NaN  1.0  1.0  1.0  NaN  3.0  NaN  1.0
7  NaN  NaN  1.0  2.0  1.0  1.0  3.0  NaN  NaN

In [80]:
# Using the previous 'df_countries' dataframe pring the existing columns:
df_countries.groupby('Continent')['Country'].apply(set)

Continent
Europe    {Spain, Belgium, France, UK}
World     {Australia, USA, Bangladesh}
Name: Country, dtype: object

### Aggregations

In [41]:
# Using the previous 'df_countries' dataframe pring the existing columns
df_countries.columns

Index(['Country', 'Capital', 'Random', 'Continent'], dtype='object')

In [42]:
# Aggregate the data per continent and obtain the count of Capitals:
df_countries.groupby(['Continent'])['Capital'].count()

Continent
Europe    4
World     3
Name: Capital, dtype: int64

In [43]:
# Aggregate the data per continent and obtain the distinct country count:
df_countries.groupby('Continent')['Country'].nunique()

Continent
Europe    4
World     3
Name: Country, dtype: int64

In [44]:
# Aggregate the data per continent and obtain the list of countries per continent:
country_group = df_countries.groupby('Continent').agg({'Country': lambda x: " ".join(x)})
country_group

                            Country
Continent
Europe      UK Spain France Belgium
World      USA Australia Bangladesh

In [45]:
# Transform the string created grouping the countries into list:
country_group.Country.apply(lambda x: x.split(" "))

Continent
Europe    [UK, Spain, France, Belgium]
World     [USA, Australia, Bangladesh]
Name: Country, dtype: object

In [87]:
# In fact more efficient if we want a list is to apply it directly:
country_group = df_countries.groupby('Continent')['Country'].apply(list)
country_group

Continent
Europe    [UK, Spain, France, Belgium]
World     [USA, Australia, Bangladesh]
Name: Country, dtype: object